Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/index.html.txt.tmx
Source language: en
Languages: ga

source: Going to post-primary school
ga: Dul chun scoile iar-bhunoideachais

source: Life Event Document Starting post-primary school Describes post-primary education, including how to choose a post-primary school and enrol your child
ga: Life Event Document Tosú ar iarbhunscoil Cur síos ar oideachais iarbhunscoile ina n-áirítear an dóigh chun iarbhunscoil a roghnú agus chun do pháiste a chlárú inti

source: Types of post-primary school
ga: Cineálacha éagsúla scoileanna iarbhunoideachais

source: There are five different types of post-primary school
ga: Tá cúig chineál scoile iarbhunoideachais ann

source: The main difference is in how your school is managed, how it is funded and who owns your school
ga: Baineann na príomhdhifríochtaí leis an gcaoi a bhainistítear is a mhaoinítear na scoileanna agus cé leo iad

source: The first three-year period of second-level education is called the Junior Cycle
ga: Cur síos ar an tSraith Shóisearach

source: This document describes the Transition Year programme, a one-year, school-based programme between Junior Cycle and Senior Cycle
ga: Cur síos ar chlár na Bliana Idirmhéanaigh

source: This document describes the Senior Cycle in post-primary schools
ga: Cur síos ar an tSraith Sinsearach i scoileanna dara leibhéil

source: Special needs education: post-primary
ga: Oideachas riachtanas speisialta: oideachas iarbhunscoile

source: This document describes post-primary education for students with disabilities
ga: Cur síos ar oideachas iarbhunscoile do mhic léinn atá faoi mhíchumas agus a bhfuil riachtanais speisialta oideachais acu

source: School transport for post-primary students
ga: Scéim iompair do scoileanna dara-leibhéil

source: The Department of Education and Skills provides subsidised school transport for eligible post-primary students
ga: Cuireann an Roinn Oideachais agus Scileanna cabhair airgid d’iompar scoile ar fáil do na scoláirí atá intofa don scéim Iompair Scoile

source: Organisations and resources for post-primary schools
ga: Eagraíochtaí agus acmhainní le haghaidh iarbhunscoileanna

source: A list of organisations and internet resources providing information on education at post-primary level
ga: Liosta eagraíochtaí agus acmhainní idirlín é seo a chuireann faisnéis ar fáil faoi chúrsaí oideachais ar an leibhéal iarbhunoideachais

source: Moving your children to secondary school
ga: Do pháisté a aistriú chuig meánscoil Éireannach

source: Different schooling options available in the secondary school system in Ireland and outlines the state examination system
ga: Tá cur síos anseo ar na roghanna sa chóras scoile ag an dara leibhéal in Éirinn agus ar an gcóras scruduithe Stáit

source: This document is in: Moving Country > Moving to Ireland > Introduction to the Irish System
ga: This document is in: Ag bogadh tíre > Teacht go hÉirinn > Tús eolais ar chóras na hÉireann

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Táillí do scoláirí tríú leibhéal
